#include "led.h"
#include "delay.h"
#include "key.h"
#include "sys.h"
#include "lcd.h"
#include "usart.h"	 	 
#include "dac.h"
#include "adc.h"
#include "usmart.h"
#include "beep.h"
#include "string.h"
//ALIENTEK战舰STM32开发板实验19
//DAC 实验  
//技术支持：www.openedv.com
//广州市星翼电子科技有限公司  
 int main(void)
 {	 
	u8 len;
	u16 i;
	char c[200];
	u16 dacval=2049;  
 	u8 t=0;
  u8 time=0;	
  int Sine12bit[256] = {2049,2079,2110,2140,2170,2200,2231,
		2261,2291,2320,2350,2380,2409,2438,2467,2496,2523,2551,2579,
		2606,2634,2660,2686,2713,2738,2763,2788,2812,2836,2859,2882,
		2905,2926,2948,2968,2988,3008,3027,3045,3063,3080,3097,3113,
		3128,3143,3157,3171,3183,3195,3206,3217,3227,3236,3245,3252,
		3260,3266,3271,3276,3280,3284,3286,3288,3289,3289,3289,3288,
		3286,3284,3280,3276,3271,3266,3260,3252,3245,3236,3227,3217,
		3206,3195,3183,3171,3157,3143,3128,3113,3097,3080,3063,3045,
		3027,3008,2988,2968,2948,2926,2905,2882,2859,2836,2812,2788,
		2763,2738,2713,2686,2660,2634,2606,2579,2551,2523,2496,2467,
		2438,2409,2380,2350,2320,2291,2261,2231,2200,2170,2140,2110,
		2079,2048,2018,1988,1958,1927,1897,1867,1836,1807,1777,1747,
		1718,1688,1659,1631,1602,1574,1546,1518,1491,1464,1437,1411,
		1385,1359,1334,1310,1285,1261,1238,1215,1193,1171,1150,1129,
		1109,1089,1070,1052,1034,1017,1000,984,969,954,940,927,914,
		902,891,880,870,861,853,845,838,832,826,821,817,813,811,809,
		808,808,808,810,812,816,820,825,830,836,844,852,860,869,879,
		890,901,913,926,939,953,968,983,999,1016,1033,1051,1069,1088,
		1108,1128,1149,1170,1192,1214,1237,1260,1284,1309,1333,1358,
		1384,1410,1436,1462,1490,1517,1545,1573,1601,1630,1658,1687,
		1716,1746,1776,1805,1835,1865,1896,1926,1956,1987,2017,2048};	 
		int Sine12bit2[32]={2047, 2447, 2831, 3185, 3498, 3750, 3939, 4056, 4095, 4056,
         3939, 3750, 3495, 3185, 2831, 2447, 2047, 1647, 1263, 909,
        599, 344, 155, 38, 0, 38, 155, 344, 599, 909, 1263, 1647
		};
	delay_init();	    	 //延时函数初始化	  
	NVIC_Configuration(); 	 //设置NVIC中断分组2:2位抢占优先级，2位响应优先级
	uart_init(9600);	 	//串口初始化为9600
	KEY_Init();			  //初始化按键程序
 	LED_Init();			     //LED端口初始化
	usmart_dev.init(72);	//初始化USMART	
 	Adc_Init();		  		//ADC初始化
	Dac1_Init();				//DAC初始化
  BEEP_Init();
	printf("\r\nDAC实验\r\n");
	printf("\r\n何志杨、谢远翔、徐晨龙组合\r\n");    
	while(1)
	 {
		if(USART_RX_STA&0x8000)
		     {		   
			       len=USART_RX_STA&0x3fff;
						 for(t=0;t<len;t++)
			      {
			        c[t]=USART_RX_BUF[t];
							USART_SendData(USART1, USART_RX_BUF[t]);//???1????
							while(USART_GetFlagStatus(USART1,USART_FLAG_TC)!=SET);//??????
						}
						USART_RX_STA=0;
						USART_ClearFlag(USART1, USART_FLAG_RXNE); 
						BEEP=0;
						if(len==6)//判断是否为输入救护车
							{
								while(1)//一直循环生成，一个540个的900Hz的正弦波，一个260个650hz的正弦波，总时间应该为1s
								{
									Dac1_sine(650,240,dacval,Sine12bit,1,256);
									Dac1_sine(950,540,dacval,Sine12bit,1,256);
								}
							}
						if(len>6)//判断是否为输入防空警报，一直循环生成，0-800Hz的正弦波3.5秒左右，之后持续生成830hz的正弦波，再逐渐降低
							{
								while(1)
								{
							   	for(i=400;i<780;i=i+1)
								  {
								  	Dac1_sine(i,(int)i/100,dacval,Sine12bit2,1,32);
									}
								    for(i=1;i<32;i++)
				            Dac1_sine(780,780,dacval,Sine12bit2,1,32);
								    for(i=780;i>400;i=i-1)
								  {
									  Dac1_sine(i,6,dacval,Sine12bit2,1,32);
								  }
							  }
							}
						memset(c,200,0);
				}
		else
				{
						time++;	
            if(time%15==0)					
						LED0=!LED0;	
						Dac1_sine(1000,10,dacval,Sine12bit,0,256);//每次循环生成10ms的正弦波型号，同时产生delay的效果
				}
 }
}
